#low
problem1 = ("Все кошки млекопитающие.\n "
            "Мурзик - кошка.\n "
            "Докажи, что Мурзик - млекопитающее.\n")

problem2 = ("Ни один студент не любит экзамены.\n"
            "Петя - студент.\n"
            "Докажи, что Петя не любит\n")

problem3 = ("Все тигры - полосатые.\n"
            "Шерхан - полосатый.\n"
            "Докажи, что Шерхан - тигр\n")

#medium
problem4 = ("Ни один человек, продающий сипульки, их не покупает.\n"
            "Если человек покупает сипульки, то он дурак.\n"
            "Кто-то покупает сипульки.\n"
            "Докажи, что какой-то дурак не продает сипульки.\n")

problem5 = ("Все, кто сдает сессию, - студенты.\n"
            "Некоторые студенты пьют кофе.\n"
            "Никто, кто пьет кофе, не высыпается.\n"
            " Докажи, что кто-то сдает сессию и не высыпается.\n")

problem6 = ("Некоторые инженеры умны.\n"
            "Все, кто умны, богаты.\n "
            "Докажи, что некоторые инженеры богаты\n")

#high
problem7 = ("Все львы - хищники.\n"
            "Существует лев. Все хищники едят мясо.\n"
            "Все, кто ест мясо, не являются вегетарианцами.\n"
            "Ни один вегетарианец не ест мясо.\n"
            "Докажи, что существует не-вегетарианец.\n")

problem8 = ("Все математики рациональны.\n"
            "Некоторые люди - математики.\n"
            "Существует иррациональный человек.\n"
            "Ни один рациональный человек не является иррациональным.\n"
            "Докажи, что существует рациональный человек и существует иррациональный человек.\n")

problem9 = ("Все вампиры бессмертны.\n"
            "Некоторые бессмертные боятся света.\n"
            "Все, кто боится света, ведут ночной образ жизни.\n"
            "Каждый вампир либо ведет ночной образ жизни, либо охотится на людей.\n "
            "Существует вампир, который не охотится на людей.\n "
            "Все, кто ведет ночной образ жизни, спят днем.\n "
            "Ни один бессмертный не спит днем.\n "
            "Докажи, что существует бессмертный, который боится света и не является вампиром.\n")

problem = [problem1, problem2, problem3, problem4, problem5, problem6, problem7, problem8, problem9]